In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('classic')
import seaborn as sns
sns.set()
%matplotlib inline

https://www.kaggle.com/datasets/victorsoeiro/netflix-tv-shows-and-movies

This dataset has two files containing the titles (titles.csv) and the cast (credits.csv) for the title.

This dataset contains +5k unique titles on Netflix with 15 columns containing their information, including:

id: The title ID on JustWatch.
title: The name of the title.
show_type: TV show or movie.
description: A brief description.
release_year: The release year.
age_certification: The age certification.
runtime: The length of the episode (SHOW) or movie.
genres: A list of genres.
production_countries: A list of countries that produced the title.
seasons: Number of seasons if it's a SHOW.
imdb_id: The title ID on IMDB.
imdb_score: Score on IMDB.
imdb_votes: Votes on IMDB.
tmdb_popularity: Popularity on TMDB.
tmdb_score: Score on TMDB.
And over +77k credits of actors and directors on Netflix titles with 5 columns containing their information, including:

person_ID: The person ID on JustWatch.
id: The title ID on JustWatch.
name: The actor or director's name.
character_name: The character name.
role: ACTOR or DIRECTOR.

In [3]:
titles = pd.read_csv(r'netflix\titles.csv')

In [4]:
credits = pd.read_csv(r'netflix\credits.csv')

In [6]:
#View Five first rows of titles dataframe
titles.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],NaN,tt0068473,7.7,107673.0,10.010,7.300
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],NaN,tt0071853,8.2,534486.0,15.461,7.811
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,NaN,150,"['war', 'action']","['GB', 'US']",NaN,tt0061578,7.7,72662.0,20.398,7.600

In [7]:
#View Five first rows of credits dataframe
credits.head()

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR

In [10]:
#Finding number of rows and columns
titles_rows=titles.shape[0]
titles_columns = titles.shape[1]
print(f"There are {titles_rows} rows and {titles_columns} columns in the titles data set")

credits_rows=credits.shape[0]
credits_columns = credits.shape[1]
print(f"There are {credits_rows} rows and {credits_columns} columns in the credits data set")

There are 5850 rows and 15 columns in the titles data set
There are 77801 rows and 5 columns in the credits data set

In [105]:
#Can you get all data about shows?
shows = movies = titles[titles["type"]=="SHOW"]
show_count = len(shows)
print(f"There are {show_count} shows in the titles dataset")

There are 2020 shows in the titles dataset

In [106]:
#Can you get all data about movies?
movies = movies = titles[titles["type"]=="MOVIE"]
movie_count = len(movies)
print(f"There are {movie_count} movies in the titles dataset")

There are 3565 movies in the titles dataset

In [107]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5585 entries, 0 to 5847
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    5585 non-null   object
 1   title                 5585 non-null   object
 2   type                  5585 non-null   object
 3   description           5577 non-null   object
 4   release_year          5585 non-null   int64
 5   age_certification     3140 non-null   object
 6   runtime               5585 non-null   int64
 7   genres                5585 non-null   object
 8   production_countries  5585 non-null   object
 9   seasons               2020 non-null   float64
 10  imdb_id               5247 non-null   object
 11  imdb_score            5191 non-null   float64
 12  imdb_votes            5177 non-null   float64
 13  tmdb_popularity       5547 non-null   float64
 14  tmdb_score            5375 non-null   float64
dtypes: float64(5), int64(2), object(8)
memory usage: 827.2+ KB

# Data Cleaning
Data Cleaning
Check for records with null values
Drop records where title is null
Drop records that do not have an entry for genres field
Drop records that do not have an entry for production_countries fieldeld

In [108]:
#Check for records with null values
for column in titles:
    if titles[column].isnull().any():
       print('{0} has {1} null values'.format(column, titles[column].isnull().sum()))

description has 8 null values
age_certification has 2445 null values
seasons has 3565 null values
imdb_id has 338 null values
imdb_score has 394 null values
imdb_votes has 408 null values
tmdb_popularity has 38 null values
tmdb_score has 210 null values

In [109]:
#drop records where title is null
titles.dropna(subset=["title"],inplace=True)

In [110]:
titles["title"].isnull().sum() #check for records where title is null

0

In [111]:
#drop records where genre is null
mt_genres = titles[titles["genres"] == "[]"]
titles.drop(mt_genres.index, inplace=True)

In [112]:
titles[titles["genres"] == "[]"].shape[0] #check for records where genre is null

0

In [113]:
titles.drop(titles[titles["production_countries"] == "[]"].index, inplace = True)
titles[titles["production_countries"] == "[]"].shape[0]

0

In [114]:
#Which movie got the highest votes?
movie_with_highest_votes = movies.loc[movies['imdb_votes'].idxmax()]

print(f"The movie with the highest votes is: {movie_with_highest_votes['title']} with {movie_with_highest_votes['imdb_votes']} votes.")

The movie with the highest votes is: Inception with 2294231.0 votes.

In [115]:
#How many movies are in the top 1000 that are less than 2 hours?
movies = titles[titles["type"]=="MOVIE"]
movie_with_less_2Hour = len(movies.head(1000).loc[movies['runtime'] < 120])
print(f"There are {movie_with_less_2Hour} movies  in the top 1000 with runtime less than 2 hours")

There are 670 movies  in the top 1000 with runtime less than 2 hours

In [116]:
#How do you get all data about directors?

directors = credits[credits['role'] == 'DIRECTOR']
directors

       person_id         id             name character      role
36          3308    tm84618  Martin Scorsese       NaN  DIRECTOR
59         17727   tm154986     John Boorman       NaN  DIRECTOR
106        11475   tm127384      Terry Jones       NaN  DIRECTOR
107        11473   tm127384    Terry Gilliam       NaN  DIRECTOR
162         1063   tm120801   Robert Aldrich       NaN  DIRECTOR
...          ...        ...              ...       ...       ...
77745    1785287  tm1216735       Joe Penney       NaN  DIRECTOR
77761     753271   tm985215   Barry Gonzalez       NaN  DIRECTOR
77777    1827884  tm1097142    Mohamed Bakir       NaN  DIRECTOR
77789    1962840  tm1014599    Seyi Babatope       NaN  DIRECTOR
77800    1950416  tm1059008   Julian Gaviria       NaN  DIRECTOR

[4550 rows x 5 columns]

In [117]:
#Find these 3 directors: James Cameron ; Luc Besson ; John Woo
directors = credits[credits['role'] == 'DIRECTOR']
three_directors = ['James Cameron','Luc Besson','John Woo']
filtered_directors = directors[directors['name'].isin(three_directors)]
filtered_directors

       person_id        id           name character      role
2205        3156  tm191110  James Cameron       NaN  DIRECTOR
2309        8673   tm27395       John Woo       NaN  DIRECTOR
2486         977  tm116655     Luc Besson       NaN  DIRECTOR
36219       8673  tm311319       John Woo       NaN  DIRECTOR

In [118]:
#Find all directors with name starting with Steven.
directors = credits[credits['role'] == 'DIRECTOR']
names_start_with_Steven = directors[directors['name'].str.startswith('Steven')]
names_start_with_Steven

       person_id         id                name character      role
4765        2779   tm111828    Steven Spielberg       NaN  DIRECTOR
5192        2779   tm172683    Steven Spielberg       NaN  DIRECTOR
5353        2779    tm89677    Steven Spielberg       NaN  DIRECTOR
10095     375280    tm25842       Steven Bognar       NaN  DIRECTOR
11215     375280    ts19384       Steven Bognar       NaN  DIRECTOR
13466       6315   tm158304   Steven Soderbergh       NaN  DIRECTOR
17200       5397   tm165521       Steven Knight       NaN  DIRECTOR
17820      24221   tm136601        Steven Brill       NaN  DIRECTOR
23074      24221   tm239707        Steven Brill       NaN  DIRECTOR
23774      17162   tm244381    Steven C. Miller       NaN  DIRECTOR
33712      24221   tm437608        Steven Brill       NaN  DIRECTOR
34399      24221   tm266685        Steven Brill       NaN  DIRECTOR
41813    2219991   tm461349      Steven Rinella       NaN  DIRECTOR
47909       6315   tm428557   Steven Soderbergh       NaN  DIRECTOR
48726       6315   tm428558   Steven Soderbergh       NaN  DIRECTOR
49269     375280   tm446176       Steven Bognar       NaN  DIRECTOR
51417     375280   tm877456       Steven Bognar       NaN  DIRECTOR
51586      24221   tm847998        Steven Brill       NaN  DIRECTOR
74677     305471  tm1037704  Steven K. Tsuchida       NaN  DIRECTOR

In [120]:
#What are the 3 most popular movies according to tmdb?
top_3_popular_movies = movies.sort_values(by='tmdb_popularity', ascending=False).head(3)
top_3_popular_movies['title']

4707           Incantation
4702         The Sea Beast
4714    Valley of the Dead
Name: title, dtype: object

In [121]:
#Which movie(s) were directed by Brenda Chapman?
directors = credits[(credits['role'] == 'DIRECTOR') & (credits['name'] == 'Brenda Chapman')]
merged_data = movies.merge(directors, on='id', how='inner')['title'].to_frame()
merged_data

Empty DataFrame
Columns: [title]
Index: []

In [123]:
#Whose director made the most movies?
most_movies = credits[credits['role'] == 'DIRECTOR'].groupby('name').size().sort_values(ascending=False).head(1)
most_movies

name
Raúl Campos    20
dtype: int64

In [124]:
#What were the top 10 movies according to IMDB score?
top_10_high_score_movies = movies.sort_values(by='imdb_score', ascending=False).head(10)
top_10_high_score_movies['title']

4771                                       Major
3271    David Attenborough: A Life on Our Planet
2547                           C/o Kancharapalem
97                                  Forrest Gump
237                                    Inception
4818                          Bo Burnham: Inside
435                                   Anbe Sivam
36                                    GoodFellas
792         Chhota Bheem & Krishna in Mayanagari
438                          A Lion in the House
Name: title, dtype: object

In [125]:
#What were the top 10 shows according to IMDB score?
top_10_high_score_shows = shows.sort_values(by='imdb_score', ascending=False).head(10)
top_10_high_score_shows['title']

216                                   Breaking Bad
3147                                    Our Planet
233                     Avatar: The Last Airbender
1258                                    Reply 1988
3068                                The Last Dance
1886                                     My Mister
3500                                  Kota Factory
835                                Attack on Titan
1158    Leah Remini: Scientology and the Aftermath
165                                         Okupas
Name: title, dtype: object

In [131]:
#What were the bottom 10 movies according to IMDB score?
bottom_10_movies = movies.sort_values(by='imdb_score', ascending=False).tail(10)
bottom_10_movies['title']

5646                                     Trese After Dark
5652                          What Would Sophia Loren Do?
5681                                        Maha Samudram
5697                                                Aelay
5719      The Last Kids on Earth: Happy Apocalypse to You
5728                                            The Crime
5729                                        Love or Money
5765                                              Mughizh
5772    Sam Smith: Love Goes – Live at Abbey Road Studios
5790                               My Heroes Were Cowboys
Name: title, dtype: object

In [132]:
#What were the bottom 10 shows according to IMDB score?
bottom_10_shows = shows.sort_values(by='imdb_score', ascending=False).tail(10)
bottom_10_shows['title']

5433                                        Word of Honor
5475             Transformers: War for Cybertron: Kingdom
5488    Revelations: The Masters of the Universe: Reve...
5497                                        The Houseboat
5499                                    Reflection of You
5540                                      So Not Worth It
5549                                        The Fame Game
5573                                           Till Death
5657                                     Street Food: USA
5833                                           HQ Barbers
Name: title, dtype: object

In [135]:
#What were the average IMDB and TMDB scores for shows and movies?
average_scores = titles.groupby('type').agg({'imdb_score': 'mean', 'tmdb_score': 'mean'})
average_scores

       imdb_score  tmdb_score
type
MOVIE    6.251616    6.461039
SHOW     6.987926    7.486417

In [144]:
#What were the 5 most common age certifications for movies?
five_common_age_cert = movies['age_certification'].value_counts().head(5)
five_common_age_cert

age_certification
R        550
PG-13    444
PG       231
G        110
NC-17     16
Name: count, dtype: int64

In [145]:
#What were the top 3 most common genres in movies and shows?
top_3_genres_movies = movies['genres'].str.split(', ', expand=True).stack().value_counts().head(3)
top_3_genres_shows = shows['genres'].str.split(', ', expand=True).stack().value_counts().head(3)

print("Top 3 genres in movies:")
print(top_3_genres_movies)

print("\nTop 3 genres in shows:")
print(top_3_genres_shows)

Top 3 genres in movies:
['drama'     653
['comedy'    548
'drama'      510
Name: count, dtype: int64

Top 3 genres in shows:
['drama'    434
'drama'     367
'comedy'    261
Name: count, dtype: int64

In [147]:
#What are top 10 shows with most seasons? 
top_10_shows_most_seasons = shows.sort_values(by='seasons', ascending=False).head(10)

print("Top 10 shows with most seasons:")
print(top_10_shows_most_seasons[['title', 'seasons']])

Top 10 shows with most seasons:
                        title  seasons
91                   Survivor     42.0
48           Wheel of Fortune     39.0
101             The Challenge     37.0
217                  Top Gear     32.0
114             Power Rangers     29.0
95                    Pokémon     25.0
261  America's Next Top Model     24.0
45           Thomas & Friends     24.0
100                 One Piece     21.0
232                      NCIS     20.0

In [148]:
#Calculating the average runtime of movies and TV shows 
average_runtime = titles.groupby('type')['runtime'].mean()

print("Average runtime of movies and TV shows:")
print(average_runtime)

Average runtime of movies and TV shows:
type
MOVIE    99.643478
SHOW     39.266337
Name: runtime, dtype: float64

In [149]:
#what is the oldest movie ?
oldest_movie = movies.nsmallest(1, 'release_year')

print("The oldest movie is:")
print(oldest_movie[['title', 'release_year']])

The oldest movie is:
              title  release_year
13  White Christmas          1954

In [153]:
#How many shows have only 1 season ?
shows_with_one_season = shows[shows['seasons'] == 1]

number_of_shows_with_one_season = len(shows_with_one_season)

print(f"The number of shows with only 1 season is: {number_of_shows_with_one_season}")

The number of shows with only 1 season is: 1152

In [155]:
#How many show have more than 1 season ?
shows_with_more_season = shows[shows['seasons'] > 1]

number_of_shows_with_more_season = len(shows_with_more_season)

print(f"The number of shows with more than 1 season is: {number_of_shows_with_more_season}")

The number of shows with more than 1 season is: 868

In [156]:
#what show has the higest imdb score ?
highest_imdb_show = shows.nlargest(1, 'imdb_score')

print("The show with the highest IMDb score is:")
print(highest_imdb_show[['title', 'imdb_score']])

The show with the highest IMDb score is:
            title  imdb_score
216  Breaking Bad         9.5

In [157]:
#Based on the imdb_scores, what are the top 5 shows ?
top_5_shows = shows.nlargest(5, 'imdb_score')

print("Top 5 shows based on IMDb scores:")
print(top_5_shows[['title', 'imdb_score']])

Top 5 shows based on IMDb scores:
                           title  imdb_score
216                 Breaking Bad         9.5
233   Avatar: The Last Airbender         9.3
3147                  Our Planet         9.3
1258                  Reply 1988         9.2
1886                   My Mister         9.1

In [159]:
#Based on the imdb_scores, what are the worst 5 shows ?
worst_5_shows = shows.nsmallest(5, 'imdb_score')

print("Worst 5 shows based on IMDb scores:")
print(worst_5_shows[['title', 'imdb_score']])

Worst 5 shows based on IMDb scores:
                                  title  imdb_score
5298  Thomas & Friends: All Engines Go!         2.0
5695                     He's Expecting         2.0
5320                         Hype House         2.1
2838                  A House of Blocks         2.3
3598                         Until Dawn         2.4

In [161]:
#Top 5 Longest Movies Name and Duration.
top_5_longest_movies = movies.nlargest(5, 'runtime')

print("Top 5 longest movies based on duration:")
print(top_5_longest_movies[['title', 'runtime']])

Top 5 longest movies based on duration:
                                 title  runtime
923                     Bonnie & Clyde      240
438                A Lion in the House      225
347  Lagaan: Once Upon a Time in India      224
412                       Jodhaa Akbar      214
406           Kabhi Khushi Kabhie Gham      210

In [163]:
#Top 5 Shortest Movies Name and Duration
top_5_Shortest_movies = movies.nsmallest(5, 'runtime')

print("Top 5 longest movies based on duration:")
print(top_5_Shortest_movies[['title', 'runtime']])

Top 5 longest movies based on duration:
                      title  runtime
5766          Time to Dance        2
1014                 Silent        3
4406            Sol Levante        4
4581  Amsterdam to Anatolia        6
4271       Cops and Robbers        8

In [164]:
#Top 5 TV Show having Maximum Season.

top_5_max_season_shows = shows.nlargest(5, 'seasons')

print("Top 5 TV shows with the maximum number of seasons:")
print(top_5_max_season_shows[['title', 'seasons']])

Top 5 TV shows with the maximum number of seasons:
                title  seasons
91           Survivor     42.0
48   Wheel of Fortune     39.0
101     The Challenge     37.0
217          Top Gear     32.0
114     Power Rangers     29.0

In [165]:
#Top 5 best category in which Most TV Show Released.

top_5_categories_tv_shows = shows['genres'].str.split(', ', expand=True).stack().value_counts().head(5)

print("Top 5 categories with the most TV shows released:")
print(top_5_categories_tv_shows)

Top 5 categories with the most TV shows released:
['drama'     434
'drama'      367
'comedy'     261
['comedy'    239
'action'     226
Name: count, dtype: int64

In [166]:
#Top 5 best category in which Most Movies Released.
top_5_categories_movies = movies['genres'].str.split(', ', expand=True).stack().value_counts().head(5)

print("Top 5 categories with the most movies released:")
print(top_5_categories_movies)

Top 5 categories with the most movies released:
['drama'      653
['comedy'     548
'drama'       510
'drama']      474
['comedy']    356
Name: count, dtype: int64

In [167]:
#Top 5 Highest number of TV Show Released By Year.
top_5_years_tv_shows = shows['release_year'].value_counts().head(5)

print("Top 5 years with the highest number of TV shows released:")
print(top_5_years_tv_shows)

Top 5 years with the highest number of TV shows released:
release_year
2020    296
2019    296
2021    294
2018    280
2017    175
Name: count, dtype: int64

In [168]:
#Top 5 Highest number of Movies Released By Year.
top_5_years_movies = movies['release_year'].value_counts().head(5)

print("Top 5 years with the highest number of movies released:")
print(top_5_years_movies)

Top 5 years with the highest number of movies released:
release_year
2019    495
2020    465
2018    464
2021    432
2017    376
Name: count, dtype: int64

In [170]:
#Top 5 Director who directed Most number of Movies/TV Show.
top_5_directors = credits[credits['role'] == 'DIRECTOR']['name'].value_counts().head(5)

print("Top 5 directors who directed the most number of movies/TV shows:")
print(top_5_directors)

Top 5 directors who directed the most number of movies/TV shows:
name
Raúl Campos     20
Jan Suter       19
Ryan Polito     17
Jay Karas       15
Marcus Raboy    14
Name: count, dtype: int64

In [171]:
#Top 5 Movie Rating which Most movies have.
top_5_movie_ratings = movies['imdb_score'].value_counts().head(5)

print("Top 5 movie ratings that most movies have:")
print(top_5_movie_ratings)

Top 5 movie ratings that most movies have:
imdb_score
6.3    142
6.5    139
6.6    121
6.2    120
6.4    118
Name: count, dtype: int64